# 데이콘_Pandas 튜토리얼 
- (Ch 01 - 07)

### Ch06 컬럼 연산
- 목표 : 컬럼 간에 사칙연산을 수행

In [7]:
import pandas as pd

data = pd.read_csv('data/data03.csv')
data

    도시       인구수        남자        여자
0   서울   9741381   4757642   4984229
1   부산   3416918   1680933   1735985
2   인천   2925967   1472081   1453886
3   대구   2453041   1218326   1234715
4   대전   1525849    765718    760131
5   광주   1496172    745122    751050
6   수원   1193894    601097    592797
7   울산   1147037    589233    557804
8   고양   1068641    523803    544838
9   용인   1061440    526824    534617
10  총합  26030340  12880779  13150052

# 산술 연산
- 기존에 가지고 있는 컬럼들을 이용하여 새로운 컬럼을 만들 수 있습니다.
  
    
- 판다스의 컬럼끼리는 산술연살자를 이용하여 연산이 가능합니다.

In [11]:
# 컬럼끼리 덧셈
data['남자+여자'] =data['남자'] + data['여자']
data
# print(data['인구수'] == data['남자+여자'])

    도시       인구수        남자        여자     남자+여자  남자 - 여자
0   서울   9741381   4757642   4984229   9741871  -226587
1   부산   3416918   1680933   1735985   3416918   -55052
2   인천   2925967   1472081   1453886   2925967    18195
3   대구   2453041   1218326   1234715   2453041   -16389
4   대전   1525849    765718    760131   1525849     5587
5   광주   1496172    745122    751050   1496172    -5928
6   수원   1193894    601097    592797   1193894     8300
7   울산   1147037    589233    557804   1147037    31429
8   고양   1068641    523803    544838   1068641   -21035
9   용인   1061440    526824    534617   1061441    -7793
10  총합  26030340  12880779  13150052  26030831  -269273

In [12]:
# 컬럼끼리 뺄쎔
data['남자 - 여자'] =data['남자'] -  data['여자']
data

    도시       인구수        남자        여자     남자+여자  남자 - 여자
0   서울   9741381   4757642   4984229   9741871  -226587
1   부산   3416918   1680933   1735985   3416918   -55052
2   인천   2925967   1472081   1453886   2925967    18195
3   대구   2453041   1218326   1234715   2453041   -16389
4   대전   1525849    765718    760131   1525849     5587
5   광주   1496172    745122    751050   1496172    -5928
6   수원   1193894    601097    592797   1193894     8300
7   울산   1147037    589233    557804   1147037    31429
8   고양   1068641    523803    544838   1068641   -21035
9   용인   1061440    526824    534617   1061441    -7793
10  총합  26030340  12880779  13150052  26030831  -269273

In [13]:
# 컬럼끼리 차이의 절대값
data['남자 - 여자_절대값'] = data['남자 - 여자'].abs()

data

    도시       인구수        남자        여자     남자+여자  남자 - 여자  남자 - 여자_절대값
0   서울   9741381   4757642   4984229   9741871  -226587       226587
1   부산   3416918   1680933   1735985   3416918   -55052        55052
2   인천   2925967   1472081   1453886   2925967    18195        18195
3   대구   2453041   1218326   1234715   2453041   -16389        16389
4   대전   1525849    765718    760131   1525849     5587         5587
5   광주   1496172    745122    751050   1496172    -5928         5928
6   수원   1193894    601097    592797   1193894     8300         8300
7   울산   1147037    589233    557804   1147037    31429        31429
8   고양   1068641    523803    544838   1068641   -21035        21035
9   용인   1061440    526824    534617   1061441    -7793         7793
10  총합  26030340  12880779  13150052  26030831  -269273       269273

In [14]:
# 컬럼 비율 
data['남자/여자'] = data['남자']/data['여자']
data

    도시       인구수        남자        여자     남자+여자  남자 - 여자  남자 - 여자_절대값     남자/여자
0   서울   9741381   4757642   4984229   9741871  -226587       226587  0.954539
1   부산   3416918   1680933   1735985   3416918   -55052        55052  0.968288
2   인천   2925967   1472081   1453886   2925967    18195        18195  1.012515
3   대구   2453041   1218326   1234715   2453041   -16389        16389  0.986726
4   대전   1525849    765718    760131   1525849     5587         5587  1.007350
5   광주   1496172    745122    751050   1496172    -5928         5928  0.992107
6   수원   1193894    601097    592797   1193894     8300         8300  1.014001
7   울산   1147037    589233    557804   1147037    31429        31429  1.056344
8   고양   1068641    523803    544838   1068641   -21035        21035  0.961392
9   용인   1061440    526824    534617   1061441    -7793         7793  0.985423
10  총합  26030340  12880779  13150052  26030831  -269273       269273  0.979523

- 하나의 상수를 이용한 연산

In [15]:
data['여자_100명당_남자수'] = data['남자/여자']*100
data

,도시,인구수,남자,여자,남자+여자,남자 - 여자,남자 - 여자_절대값,남자/여자,여자_100명당_남자수
0,서울,9741381,4757642,4984229,9741871,-226587,226587,0.954539,95.453921
1,부산,3416918,1680933,1735985,3416918,-55052,55052,0.968288,96.828774
2,인천,2925967,1472081,1453886,2925967,18195,18195,1.012515,101.251474
3,대구,2453041,1218326,1234715,2453041,-16389,16389,0.986726,98.672649
4,대전,1525849,765718,760131,1525849,5587,5587,1.007350,100.735005
5,광주,1496172,745122,751050,1496172,-5928,5928,0.992107,99.210705
6,수원,1193894,601097,592797,1193894,8300,8300,1.014001,101.400142
7,울산,1147037,589233,557804,1147037,31429,31429,1.056344,105.634416
8,고양,1068641,523803,544838,1068641,-21035,21035,0.961392,96.139219
9,용인,1061440,526824,534617,1061441,-7793,7793,0.985423,98.542321
10,총합,26030340,12880779,13150052,26030831,-269273,269273,0.979523,97.952305

In [16]:
data.to_csv('data/data06.csv', index = False)

data.to_csv('data/data06_pandas.csv', index = False)